Repository: Riders08/m-t-o_project
Catalog: meteo_app/lib/l10n/intl_*.arb
Languages: de, es, fr, it, ja, ko, nl, pl, pt, ru, uk, zh

# appTitle
source: Weather
de: Wetter
es: Clima
fr: Météo
it: Meteo
ja: 天気
ko: 날씨
nl: Weer
pl: Pogoda
pt: Clima
ru: Погода
uk: Погода
zh: 天气

source: City not found
de: Stadt nicht gefunden
es: Ciudad no encontrada
fr: Ville introuvable
it: Città non trovata
ja: 都市が見つかりません
ko: 도시를 찾을 수 없습니다
nl: Stad niet gevonden
pl: Nie znaleziono miasta
pt: Cidade não encontrada
ru: Город не найден
uk: Місто не знайдено
zh: 未找到城市

# locationError
source: Unable to get your location
de: Standort konnte nicht ermittelt werden
es: No se pudo obtener tu ubicación
fr: Impossible d'obtenir votre position
it: Impossibile ottenere la tua posizione
ja: 現在地を取得できません
ko: 현재 위치를 가져올 수 없습니다
nl: Kan je locatie niet ophalen
pl: Nie można pobrać Twojej lokalizacji
pt: Não foi possível obter sua localização
ru: Не удалось определить ваше местоположение
uk: Не вдалося отримати ваше місцезнаходження
zh: 无法获取您的位置

# bigError
source: Major error
de: Schwerwiegender Fehler
es: Error grave
fr: Erreur énorme
it: Errore grave
ja: 重大なエラー
ko: 심각한 오류
nl: Grote fout
pl: Poważny błąd
pt: Erro grave
ru: Серьезная ошибка
uk: Серйозна помилка
zh: 重大错误

# getDataAPIError
source: Failed to retrieve data from the API!
de: Fehler beim Abrufen der API-Daten!
es: ¡Error al obtener los datos de la API!
fr: La récupération des données de l'API a échouée !
it: Impossibile recuperare i dati dall'API!
ja: API からデータを取得できませんでした。
ko: API에서 데이터를 가져오지 못했습니다!
nl: Het ophalen van gegevens van de API is mislukt!
pl: Nie udało się pobrać danych z API!
pt: Falha ao recuperar dados da API!
ru: Не удалось получить данные с API!
uk: Не вдалося отримати дані з API!
zh: 无法从 API 获取数据！

# getLocationError
source: Error while retrieving your location
de: Fehler beim Abrufen deines Standorts
es: Error al obtener tu ubicación
fr: Erreur lors de la récupération de votre localisation
it: Errore durante il recupero della tua posizione
ja: 位置情報の取得中にエラーが発生しました
ko: 위치 정보를 가져오는 중 오류가 발생했습니다
nl: Fout bij het ophalen van je locatie
pl: Błąd podczas pobierania lokalizacji
pt: Erro ao recuperar sua localização
ru: Ошибка при получении вашего местоположения
uk: Помилка під час отримання вашого місцезнаходження
zh: 获取您的位置时出错

# locationNotActive
source: Your location is disabled
de: Dein Standort ist deaktiviert
es: Tu ubicación está desactivada
fr: Votre localisation est désactivé
it: La tua posizione è disattivata
ja: 位置情報が無効になっています
ko: 위치 정보가 비활성화되어 있습니다
nl: Je locatie is uitgeschakeld
pl: Twoja lokalizacja jest wyłączona
pt: Sua localização está desativada
ru: Ваше местоположение отключено
uk: Ваше місцезнаходження вимкнено
zh: 您的位置已禁用

# autoriwedLocationError
source: You did not grant permission to access your location.
de: Du hast keine Berechtigung erteilt, auf deinen Standort zuzugreifen.
es: No otorgaste permiso para acceder a tu ubicación.
fr: Vous n'avez pas donnée l'autorisation à avoir accès à votre localisation.
it: Non hai concesso l'autorizzazione per accedere alla tua posizione.
ja: 位置情報へのアクセス権限が許可されていません。
ko: 위치 정보 접근 권한이 허용되지 않았습니다.
nl: Je hebt geen toestemming gegeven om toegang te krijgen tot je locatie.
pl: Nie udzielono pozwolenia na dostęp do lokalizacji.
pt: Você não concedeu permissão para acessar sua localização.
ru: Вы не предоставили разрешение на доступ к вашему местоположению.
uk: Ви не надали дозвіл на доступ до вашого місцезнаходження.
zh: 您未授予访问位置的权限。

# permissionLocationError
source: Location permission permanently denied.
de: Standortberechtigung dauerhaft verweigert.
es: Permiso de ubicación denegado permanentemente.
fr: Permission de récupération de localisation refusée définitivement.
it: Autorizzazione alla posizione negata in modo permanente.
ja: 位置情報の権限が永久に拒否されました。
ko: 위치 정보 권한이 영구적으로 거부되었습니다.
nl: Locatietoestemming permanent geweigerd.
pl: Pozwolenie na lokalizację zostało trwale odrzucone.
pt: Permissão de localização negada permanentemente.
ru: Разрешение на доступ к местоположению было окончательно отклонено.
uk: Дозвіл на місцезнаходження остаточно відхилено.
zh: 位置权限被永久拒绝。

# getLocationTimeError
source: Retrieving your location took too long
de: Das Abrufen deines Standorts hat zu lange gedauert
es: La obtención de tu ubicación tardó demasiado
fr: La récupération de votre localisation à mis trop de temps
it: Il recupero della tua posizione ha richiesto troppo tempo
ja: 位置情報の取得に時間がかかりすぎました
ko: 위치 정보를 가져오는 데 시간이 너무 오래 걸렸습니다
nl: Het ophalen van je locatie heeft te lang geduurd
pl: Pobranie Twojej lokalizacji zajęło za dużo czasu
pt: A recuperação da sua localização demorou muito
ru: Получение вашего местоположения заняло слишком много времени
uk: Отримання вашого місцезнаходження зайняло надто багато часу
zh: 获取您的位置耗时过长

# place
source: City/Country
de: Stadt/Land
es: Ciudad/País
fr: Ville/Pays
it: Città/Paese
ja: 都市／国
ko: 도시/국가
nl: Stad/Land
pl: Miasto/Kraj
pt: Cidade/País
ru: Город/Страна
uk: Місто/Країна
zh: 城市/国家

source: Feels like
es: Sensación
fr: Ressentie
ja: 体感温度
ko: 체감온도
nl: Gevoeld
pl: Odczuwalna
pt: Sensação
ru: Ощущается как
uk: Відчувається як
zh: 体感
